src/InformationRegisters/ВидыСельскохозяйственныхКультурЗЕРНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ВидыСельскохозяйственныхКультурЗЕРНО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОКПД2Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТНВЭДНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОКПД2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/ИнтеграцияЗЕРНОКлиентПереопределяемый/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область ПодборПоОКПД2

Процедура ОткрытьФормуПодбораОКПД2(Форма, ТекущиеДанные, Владелец, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыФормы = ИнтеграцияЗЕРНОКлиент.ИнициализироватьПараметрыОткрытияФормыПодбора();
	
	ПараметрыФормы.ТекущаяСтрока = ТекущиеДанные.ОКПД2;
	ПараметрыФормы.РежимВыбора   = Истина;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "ВидПродукции") Тогда
		ПараметрыФормы.ВидПродукции = Форма.Объект.ВидПродукции;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ВидПродукцииИС") Тогда
		ПараметрыФормы.ВозвращатьСсылкуНаЭлементКлассификатора = Истина;
		ПараметрыФормы.ВидПродукции = Форма.ВидПродукцииИС;
	КонецЕсли;
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыФормы, ДополнительныеПараметры);
	КонецЕсли;
	
	ОткрытьФорму(
		"Справочник.КлассификаторНСИЗЕРНО.Форма.ФормаСпискаОКПД2",
		ПараметрыФормы,
		Владелец,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ОткрытьФормуПодбораТНВЭД(Форма, ТекущиеДанные, Владелец, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыФормы = ИнтеграцияЗЕРНОКлиент.ИнициализироватьПараметрыОткрытияФормыПодбора();
	
	ПараметрыФормы.ТекущаяСтрока = ТекущиеДанные.КодТНВЭД;
	ПараметрыФормы.РежимВыбора   = Истина;
	ПараметрыФормы.ОКПД2         = ТекущиеДанные.ОКПД2;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма.Объект, "ВидПродукции") Тогда
		ПараметрыФормы.ВидПродукции = Форма.Объект.ВидПродукции;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ВидПродукцииИС") Тогда
		ПараметрыФормы.ВозвращатьСсылкуНаЭлементКлассификатора = Истина;
		ПараметрыФормы.ВидПродукции = Форма.ВидПродукцииИС;
	КонецЕсли;
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыФормы, ДополнительныеПараметры);
	КонецЕсли;
	
	ОткрытьФорму(
		"РегистрСведений.ВидыСельскохозяйственныхКультурЗЕРНО.Форма.ФормаПодбораТНВЭД",
		ПараметрыФормы,
		Владелец,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
